<template>
 <div>
  <header-div message="债权转让与受让协议" :path="fromPath"></header-div>
  <div class="fixTop">
	   <div class="mui-content-padded registerTable">
	   	  <p class="mui-text-center"><strong>钱趣多债权转让协议</strong></p>
				
				
				<p><span>账户名：</span></p>
				<p><span>债权受让人：</span></p>
				<p><span>账户名：</span></p>
				<p><span>居间服务人： 上海钱橙互联网金融信息服务有限公司</span></p>
				<p><span>签订日期： 年 月 日</span></p>
				<p><span>签订地： 上海市黄浦区</span></p>
				<p class="title"><span>鉴于：</span></p>
				<p><span>1.居间服务人是一家在中国上海市合法成立并有效存续的有限责任公司，拥有 www.qianquduo.com网站（以下简称“网站”，本协议中凡提及该网站者，所指向的权利义务主体均系居间服务人）的经营权，向网站注册用户提供信用咨询及金融信息服务。</span></p>
				<p><span>2.债权出让人和债权受让人均已在网站注册，同意网站的《注册协议》，并自愿根据《注册协议》达成并签订本债权转让协议。本协议使用债权出让人和债权受让人事先已充分阅读并认可的网站提供的债权转让协议样本。</span></p>
				<p><span>3.债权出让人和债权受让人均已承诺其提供给居间服务人的信息真实、完整、有效。</span></p>
				<p><span>4.债权出让人具有合法的债权转让需求，债权受让人自愿以其自有的合法资金向债权出让人提供债权转让。债权受让人以本协议为依据与债权出让人形成真实、合法、有效的债权转让关系。</span></p>
				<p><span>5.债权出让人和债权受让人基于平等自愿原则，经居间服务人的居间介绍，就有关债权转让事项达成如下协议，以兹共守：</span></p>
				<p class="title"><span>第一条 债权转让基本信息</span></p>
				<p><span>1.1债权转让开始日： 债权出让人收到指定账户划付本协议项下债权转让之日</span></p>
				<p><span>1.2债权转让到期日： 以债权出让人提供的债权合同的到期日为到期日</span></p>
				<p><span>1.3还款方式：<input name="radio" disabled="disabled" type="radio" /> 等额本息 <input name="radio" disabled="disabled" type="radio" /> 按月付息 <input name="radio" disabled="disabled" type="radio" /> 按期还本 <input name="radio" disabled="disabled" type="radio" /> 到期还本付息</span></p>
				<p><span>1.4还款日： 债权转让到期日</span></p>
				<p><span>1.5债权转让金额：实际债权转让的金额</span></p>
				<p class="title"><span>第二条 债权转让的支付</span></p>
				<p><span>2.1债权受让人在同意向债权出让人出借相应款项时，已委托网站在本协议生效时将本协议项下的债权转让金直接划付至债权出让人账户。</span></p>
				<p><span>2.2债权出让人已委托网站将还款直接划付至债权受让人账户。</span></p>
				<p><span>2.3债权出让人和债权受让人均同意上述网站接受委托的行为所产生的法律后果均由相应委托方承担。</span></p>
				<p class="title"><span>第三条 债权转让的偿还</span></p>
				<p><span>3.1债权出让人承诺按照本协议第一条约定的时间和金额按期足额向债权受让人还款。</span></p>
				<p><span>3.2如债权出让人还款不足以偿还约定的本金、利息及违约金的，在根据本协议第六条规定扣除账户管理费用后，债权受让人同意各自按照其借出款项比例收取还款及利息。</span></p>
				<p class="title"><span>第四条 债权的再转让</span></p>
				<p><span>4.1债权出让人知晓并同意债权受让人于本协议履行过程中可能将其享有的债权的全部或部分转让给不特定的第三人，且转让次数无限定。</span></p>
				<p><span>4.2债权受让人将其债权全部或部分转让给第三人的，应当以信件、邮件或短信等书面形式通知债权出让人。本协议双方同意该债权转让自债权受让人书面通知发出之日起对债权出让人发生效力。</span></p>
				<p><span>4.3债权受让人将其债权全部或部分转让给第三人的，本债权转让协议中对应权利及义务一并转让给债权受让人，包括但不限于主张罚息、利息、解除合同等权利及支付中介服务费用的义务。</span></p>
				<p class="title"><span>第五条 通知</span></p>
				<p><span>5.1本协议任何一方因履行本协议做出的通知和/或文件均应以书面形式做出，通过专人送达、挂号邮递、特快专递、短信及邮件等方式传送。</span></p>
				<p><span>5.2通知在下列日期视为送达：</span></p>
				<p><span>（1）专人递送的通知，在专人递送之交付对方日为有效送达；</span></p>
				<p><span>（2）以挂号信（付清邮资）发出的通知，在寄出（以邮戳为凭）后的五个工作日内为有效送达；</span></p>
				<p><span>（3）以特快专递（付清邮资）发出的通知，在寄出（以邮戳为凭）后的三个工作日内为有效送达；</span></p>
				<p><span>（4）以短信方式发出的通知，短信成功发出即为有效送达；</span></p>
				<p><span>（5）以邮件方式发出的通知，邮件发送成功时即为有效送达。</span></p>
				<p><span>5.3协议各方有权在任何时候更改其联系信息，但应按本协议约定的送达方式在变更后三个工作日内向其他方送达通知。否则变更方应当承担由此造成的送达不能产生的法律风险及责任。</span></p>
				<p class="title"><span>第六条 债权转让居间服务费</span></p>
				<p><span>6.1居间服务费是指因居间服务人为债权出让人与债权受让人提供交易信息、信用咨询、评估、还款提醒、账户管理、还款特殊情况沟通等系列相关服务而由债权出让人与债权受让人分别支付给居间服务人的报酬。</span></p>
				<p><span>6.2债权出让人同意在债权转让成功时根据债权转让类型的不同向居间服务人支付居间服务费，具体费用根据《服务协议》确定，此笔费用债权出让人委托居间服务人在债权转让成功时从债权转让本金中直接扣除。</span></p>
				<p><span>6.3债权受让人同意在债权转让成功后按月向居间服务人支付本次债权转让所得利息的  [ 0 ]  %作为居间服务费，此笔费用债权受让人委托居间服务人在债权出让人支付债权转让利息时从利息中直接扣除。</span></p>
				<p class="title"><span>第七条 提前还款</span></p>
				<p><span>7.1债权出让人可在债权转让期间任何时候提前偿还剩余债权转让。但债权出让人应当在提前还款的5个工作日前向网站提出申请，网站收到申请后与债权出让人确定提前还款的具体情况并通知债权受让人。</span></p>
                <p><span>7.2债权出让人提前偿还债权转让的，提前还款部分按本协议第一条约定的利息和实际债权转让期限记收利息。若实际债权转让期限非自然月的整数倍的，则扣除自然月的整数倍后的其余天数的债权转让利息仍应当按天计算。</span></p>
                <p><span>7.3债权出让人提前偿还债权转让的，债权出让人与债权受让人已支付的居间服务费不予退还。</span></p>
				<p class="title"><span>第八条 逾期还款</span></p>
				<p><span>8.1债权出让人应严格履行还款义务，债权出让人未于债权转让协议规定的还款日前足额还款、但于还款日之次日起算的三个工作日内足额还款的，无需支付逾期罚息。若债权出让人在还款日之次日起算的三个工作日内未足额还款的，则应按照下列公式计算并向债权受让人支付逾期罚息，且逾期本金的正常利息不停止计算。债权出让人还清全部本金、利息、罚息之前，罚息计算不停止。</span></p>
				<p><span>罚息总额 = 逾期本息总额×对应罚息利率×逾期天数；</span></p>
				<p><span>8.2若债权出让人逾期支付任何一期还款或债权出让人出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，网站有权将债权出让人的逾期记录计入网站黑名单或相关合作方的信用记录以及国家和地方的公民征信系统；一切相关法律责任及后果概由债权出让人自负，与债权受让人及网站无涉。</span></p>
				<p><span>8.3若债权出让人逾期支付任何一期还款或债权出让人出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，经居间服务人确认，本协议项下的全部债权转让本息视同提前到期，债权出让人应立即清偿本协议项下尚未偿付的全部本金、利息、罚息及根据本协议产生的其他全部费用。</span></p>
				<p><span>8.4若债权出让人逾期支付任何一期还款，或债权出让人出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为，经居间服务人确认，债权受让人与居间服务人均可将债权出让人违约失信的相关信息及债权出让人其他信息向微博等媒体、用人单位、公安机关、检查机关、法律机关等披露，并有权将债权出让人提交或居间服务人自行收集的债权出让人的个人资料和信息与任何第三方进行数据共享，以便债权受让人、居间服务人和第三方催收逾期债权转让及对用户的其他申请进行审核之用，由此造成的损失，债权受让人与居间服务人不承担任何责任。</span></p>
				<p><span>8.5为集中维护各债权受让人权利，如债权出让人出现逾期还款，或出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为的，全体债权受让人一致同意将本协议项下债权无偿转让给居间服务人，由居间服务人统一向债权出让人追索，并委托居间服务人发送债权转让通知。但因债权出让人失踪或还款能力丧失等原因导致债权的追索不能实现或部分不能实现的，本协议项下债权经居间服务人书面通知债权受让人后重新转让还给债权受让人。债权受让人收到居间服务人书面通知后有权自行向债权出让人进行债权的追索，居间服务人应当配合提供债权受让人为实现债权所需文件。债权受让人应当承担因债权无法追索产生的一切法律责任及结果。若因在债务追索过程中居间服务人本人的重大过失导致债权受让人的利益无法实现的，居间服务人将对上述损失承担赔偿责任。</span></p>
				<p><span>8.6当债权出让人出现逾期还款，或逃避、拒绝沟通或拒绝承认欠款事实等恶意行为时，如居间服务人认定债权出让人系疑似欺诈，且居间服务人同意先行支付本金给债权受让人的，债权受让人同意将债权不可撤销地转让给居间服务人。</span></p>
				<p><span>8.7债权受让人一致同意，经追索实现的债权款项应当全额支付至居间服务人指定的账户，并在扣除为实现债权支付的相关费用，包括但不限于诉讼保全费用，律师费用及诉讼费用后，由居间服务人负责向债权受让人进行支付。如经追索实现的债权不足以偿还本协议项下约定的本金、利息及违约金的，在扣除为实现债权支付的相关费用，包括但不限于诉讼保全费用，律师费用及诉讼费用及本协议第四条规定扣除账户管理费用后，债权受让人同意各自按照其借出款项比例收取本金、利息及罚息。</span></p>
				<p><span>8.8债权出让人的个人信息或工作情况发生重大变动，可能影响债权出让人按时还款的，债权出让人应于发生前述变更后的五个工作日内书面通知债权受让人与居间服务人该种逾期可能。</span></p>
				<p class="title"><span>第九条 违约责任</span></p>
				<p><span>9.1本协议各方均应严格履行协议义务，任何一方违约，违约方应承担因违约使其他各方产生的费用和损失，包括但不限于调查费、诉讼费、律师费等。</span></p>
				<p><span>9.2各方同意，若出现如下任何一种情况，本协议项下的全部债权转让本息自动提前到期，债权出让人应立即清偿本协议项下尚未偿付的全部本金、利息、罚息及根据本协议产生的其他全部费用：</span></p>
				<p><span>（1）债权出让人因任何原因逾期支付任何一期还款的；</span></p>
				<p><span>（2）债权出让人个人信息或工作情况发生重大变动后的五个工作日内未书面通知债权受让人与居间服务人的；</span></p>
				<p><span>（3）债权出让人在债权转让后出现逃避、拒绝沟通或拒绝承认欠款事实等恶意行为的；</span></p>
				<p><span>（4）债权出让人违反本协议第十条规定的。</span></p>
				<p><span>9.3若债权出让人逾期90天支付任何一期还款的，债权出让人应当按照债权转让余额的20%支付违约金。</span></p>
				<p><span>9.4债权出让人的每期还款均应按照如下顺序清偿：</span></p>
				<p><span>（1）根据本协议产生的除本款（2）-（6）项之外的其他全部费用；</span></p>
				<p><span>（2）罚息；</span></p>
				<p><span>（3）拖欠的利息；</span></p>
				<p><span>（4）拖欠的本金；</span></p>
				<p><span>（5）正常的利息；</span></p>
				<p><span>（6）正常的本金。</span></p>
				<p class="title"><span>第十条 承诺条款</span></p>
				<p><span>10.1债权出让人承诺向债权受让人提交的一切文本、图文、个人信息等资料等均为真实、有效。</span></p>
				<p><span>10.2债权受让人承诺对本协议所涉的债权转让具有完全的支配能力，且为债权受让人的合法收入。</span></p>
				<p class="title"><span>第十一条 适用法律及争议解决</span></p>
				<p><span>11.1本协议的履行地为居间服务人实际营业地上海市黄浦区。</span></p>
				<p><span>11.2本协议的签订、履行、终止、解释均适用中华人民共和国法律，并由协议履行地 上海市黄浦区人民法院管辖。</span></p>
				<p class="title"><span>第十二条 其他</span></p>
				<p><span>12.1本协议采用电子文本形式制成，并在居间服务人网站上保留存档，各方均认可该形式协议的法律效力。</span></p>
				<p><span>12.2协议各方同意居间服务人根据客观情况不时对本协议版本进行变更及修改，并同意按照更新版本享有权利并承担义务。</span></p>
				<p><span>12.3如果本协议中的任何一条或多条违反适用的法律法规，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。</span></p>
				<p><span>12.4债权受让人通过该债权转让协议所获得的收益应自行申报并缴纳税款。</span></p>
				<p><span>12.5居间服务人接受债权出让人和债权受让人的委托所产生的法律后果由相应委托方承担。如因债权出让人或债权受让人或其他第三方（包括但不限于技术问题）造成的延误或错误，居间服务人不承担任何责任。</span></p>
				<p><span>12.6本协议自文本最终生成之日起生效。</span></p>
				<table border="0" cellpadding="0" cellspacing="0" width="100%">
					  <tr>
					  	<td width="50%">债权出让人：</td>
					  	<td>债权受让人：</td>
					  </tr>
					  <tr>
					  	<td>日期：</td>
					  	<td>日期：</td>
					  </tr>
					  <tr>
					  	<td colspan="2" width="100%">居间服务人：上海钱橙互联网金融信息服务有限公司</td>
					  </tr>
					  <tr>
					  	<td colspan="2" width="100%">日期:</td>
					  </tr>
				</table>
		 </div>
	</div>
 </div> 
</template>
<script>
    import store from '../../../store'
    import Query from '../../../assets/Query'
	import headerDiv from '../../common/HeaderDiv'
	export default {
	    components:{
	      headerDiv 
	    },
	    data(){
	      return(
	        {
	         phoneNumber:null,
	         querymess:this.$route.params?this.$route.params.mess:null,
	         fromPath:null,
	        }
	      )
	    },
	    mounted(){
	      console.log(this.$router)
	    },
        methods:{
           
        },
        beforeRouteEnter (to, from, next) {
             console.log(from)
			 
			 next(vm => {
			    // 通过 `vm` 访问组件实例
			     vm.fromPath=from.fullPath;
			     vm.queryMess=from.query;
			  });
		}
	}
</script>
<style scoped>
    
</style>
